// rerender - повторное выполнение функций компонента, весь код внутри функции запускается
// заново, на основе jsx создается новая структура элемента и под капотом реакт сравнивает ее
// с предыдущей версией и по итогу меняется только то, что изменилось

// ререндер эт оне полная перерисовка дом, реакт не трогает элементы без необходимости,
// рендерится только то что поменялось, все остальное остается прежним

// даже при малейшем изменении реакту приходится перерисовывать весь компонент,
// а если стоит strict mode, то еще каждый компонент по два раза, это никуда не годится

import { useState, useRef, memo, useCallback, useMemo } from "react";

const TodoInfo = (props) => {
  console.log("todoInfo");
  const { total, done } = props;

  // функция, которая решает проблему перерендера компонента из-за выхова функции
  const MemoizedFunc = useCallback(
    (/*сюда вставить функцию*/) => {},
    [
      /*зависимости*/
    ],
  );

  const hasTasks = total > 0;
  return (
    <>
      <div>
        Done {done} of total {total}
      </div>
      {hasTasks && <button>delete all</button>}
    </>
  );
};

export default memo(TodoInfo);
// вот эта функция и спасает от перерисовки, так как пропсы компонента не изменились
// теперь компонент будет перерисовываться только тогда, когда его аргументы изменятся
// -----------------------------------------------------------------------------------
// но если в этом компоненте будет каждый раз выызваться обработчик кнопки,
// то memo() не поможет
// -----------------------------------------------------------------------------------
// так как мы пишем обработчик прямо внутри компонента он создается заново,
// то есть появляется новая ссылка, а так как в js объекты сравниваются по сслыке,
// то она изменилась и компонент перерисовывается думая что он изменился
// -----------------------------------------------------------------------------------
// чтобы исправить это недоразумение когда компонент не поменялся,
// но всеравно перерендерится, для этого используется react useCallback()
// он нужен чтобы запомнить функцию между рендерами чтобы она не пересоздавалась каждый раз
// -----------------------------------------------------------------------------------
// нам просто нужно обернуть необходимую функцию в useCallback(вот и тут функция)
// зависимости оставляем пустыми
// -----------------------------------------------------------------------------------
// хук useCallback полезен там, где обработчик передается в дочерние компоненты,
// где обработчик обернут в реакт мемо
// -----------------------------------------------------------------------------------
// хук useMemo() по синтаксису такой же как и useCallback, но нужен он тогда
// когда параметры правда меняются, но нам допустим не все нужны и вот
// тут в зависимостях в [] нужно как раз эти пропсы и указать на которые useMemo
// будет тригериться и вызывать перерендер
// -----------------------------------------------------------------------------------
// хук useMemo() к примеру будет полезно для фильтрации когда вводимых символов нет в списке
// поиска и он не будет перерендериться так как нечего искать
// -----------------------------------------------------------------------------------
// после введения мемоизации код становится стабильнее и ссылки не меняются так часто,
// что улучшает и оптимизирует работу интерфейса
