import { useState, useEffect, useRef } from "react";

// в реакт есть два подхода к рабоате с формами и их компонентами:
//              упарвляемые и неуправляемые

// упарвляемый компонент это когда его значение хранится во внутреннем состоянии
//  и обновляется при каждом вводе

// неуправляемый компонент рабоатет с самим дом элементов и не создает состояния для него
// и не хранит их, то есть это настоящее изменение дом

const [task, setTask] = useState([
  // хранит значение переменной в task
  { id: 1, name: "alex", age: 18 }, // и изменяет с пмомошью setTask
  { id: 2, name: "Mari", age: 22 },
]);

const newTaskRef = useRef(null);

// управляемый подход нужен, если необходимо валидировать данные, автоподстоновку
// или как-то реагировать на изменение в процессе ввода

// неуправляемый подход полезен если нужно быстро получить доступ к дом,
// сфокусировать поле ввода или заблюрить, не создавая дополнительных рендеров

const renderCount = 0;

// срабатывает после каждого рендера
// если бы тут был второй аргумент в виде зависимостей []
// тогда бы рендер сработал всего один раз при каждом изменении
useEffect(() => {
  renderCount.current++;
  console.log("render count: ", renderCount);
}); // тут нет второго аргумента []

// useRef дает доступ к дом элементам без перерисовки компонентов, не хранит состояние,
// хранят произвольные значения, которые не должны вызывать перерендер
